---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.Pipe.PipeSegment
zh: 管道、水管、管线
source: html/bc1e5201-3ba2-0e18-54bd-4377afc656fe.htm
---
# Autodesk.Revit.DB.Plumbing.Pipe.PipeSegment Property

**中文**: 管道、水管、管线

The pipe segment that was assigned to this pipe according to the routing preference.

## Syntax (C#)
```csharp
public PipeSegment PipeSegment { get; }
```